In [130]:
import pandas as pd

# 5.1 Introduction to pandas Data Structures

In [131]:
from pandas import Series, DataFrame

### Series

In [132]:
obj = pd.Series([4, 7, -5, 3])

In [133]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

And so on...

In [134]:
obj.values

array([ 4,  7, -5,  3])

In [135]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [136]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [137]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [138]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b",  "a", "c"])

In [139]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [140]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [141]:
obj2["a"]

-5

In [142]:
obj2["d"] = 6

In [143]:
obj2["d"]

6

In [144]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [145]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [146]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [147]:
import numpy as np

In [148]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [149]:
"b" in obj2

True

In [150]:
"e" in obj2

False

In [151]:
sdata = {"Ohio": 3500, "Texas": 71000, "Oregon":16000, "Utah": 5000}

In [152]:
obj3= pd.Series(sdata)

In [153]:
obj3

Ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [154]:
obj3.to_dict()

{'Ohio': 3500, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [155]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [156]:
obj4 = pd.Series(sdata, index=states)

In [157]:
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [158]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [159]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [160]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [161]:
obj3

Ohio       3500
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [162]:
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [163]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [164]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [165]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [166]:
data = {"state":["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [167]:
frame = pd.DataFrame(data)

In [168]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [169]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [170]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [171]:
frame2 = pd.DataFrame(data, columns = ["year", "state", "pop", "debt"])

In [172]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [173]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [174]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [175]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [176]:
frame2.loc[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: 0, dtype: object

In [177]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [178]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

frame2["debt"] = 66.7

In [179]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [180]:
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

In [181]:
frame2["debt"] = val

In [182]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [183]:
frame2["eastern"] = frame2["state"]=="Ohio"

In [184]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [185]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [186]:
del frame2["eastern"]

In [187]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [188]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [189]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
   ....:                "Nevada": {2001: 2.4, 2002: 2.9}}

In [190]:
frame3 = pd.DataFrame(populations)

In [191]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [192]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [193]:
In [77]: pdata = {"Ohio": frame3["Ohio"][:-1],
   ....:          "Nevada": frame3["Nevada"][:2]}

In [78]: pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [194]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [195]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [196]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

In [197]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [198]:
index = obj.index

In [199]:
index

Index(['a', 'b', 'c'], dtype='object')

In [200]:
index[1:]

Index(['b', 'c'], dtype='object')

In [201]:
index[1] = "d"

TypeError: Index does not support mutable operations

In [202]:
labels = pd.Index(np.arange(3))

In [203]:
labels

Index([0, 1, 2], dtype='int64')

In [204]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [205]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [206]:
obj2.index is labels

True

In [207]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [208]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object')

In [209]:
"Ohio" in frame3.columns

True

In [210]:
2003 in frame3.index

False

In [211]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [212]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ["d", "b", "a", "c"])

In [213]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [214]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [215]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [216]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [217]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [218]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
   .....:                      index=["a", "c", "d"],
   .....:                      columns=["Ohio", "Texas", "California"])

In [219]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [220]:
frame2 = frame.reindex(index = ["a", "b", "c", "d"])

In [221]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [222]:
states = ["Texas", "Utah", "California"]

In [223]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [224]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [225]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [227]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [228]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [229]:
new_obj = obj.drop("c")

In [230]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [231]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [234]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns = ["one", "two", "three", "four"])

In [235]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [237]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [239]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [240]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [242]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [245]:
data.drop(["two", "four"], axis = "columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [246]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [247]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [248]:
obj["b"]

1.0

In [249]:
obj[1]

/var/folders/cn/2lgryvj10c92k5wktj1wn8tr0000gp/T/ipykernel_24195/2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [250]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [251]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [253]:
obj[[1, 3]]

/var/folders/cn/2lgryvj10c92k5wktj1wn8tr0000gp/T/ipykernel_24195/2982346117.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [254]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [255]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [256]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [257]:
obj1

2    1
0    2
1    3
dtype: int64

In [258]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [259]:
obj1

2    1
0    2
1    3
dtype: int64

In [260]:
obj2

a    1
b    2
c    3
dtype: int64

In [261]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [262]:
obj2[[0, 1, 2]]

/var/folders/cn/2lgryvj10c92k5wktj1wn8tr0000gp/T/ipykernel_24195/2599987575.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [263]:
obj2.loc[[0, 1]]

KeyError: "None of [Index([0, 1], dtype='int64')] are in the [index]"

In [264]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [265]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [266]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [267]:
obj2.loc["b":"c"] = 5

In [268]:
obj2

a    1
b    5
c    5
dtype: int64

In [270]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   .....:                     index=["Ohio", "Colorado", "Utah", "New York"],
   .....:                     columns=["one", "two", "three", "four"])

In [271]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [272]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [274]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [276]:
data[:3]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [278]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [279]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [281]:
data[data < 5] =0

In [282]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [283]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [284]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [285]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [286]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [288]:
data.iloc[2, [3, 0 ,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [289]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [297]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [298]:
data.loc[data.three>=2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [299]:
ser = pd.Series(np.arange(3.))

In [300]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [301]:
ser[1]

1.0

In [302]:
ser[-1]

KeyError: -1

In [303]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [304]:
ser2 = pd.Series(np.arange(3.), index=["d", "b", "c"])

In [305]:
ser2[-1]

/var/folders/cn/2lgryvj10c92k5wktj1wn8tr0000gp/T/ipykernel_24195/811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [306]:
ser.iloc[-1]

2.0

In [307]:
ser[:2]

0    0.0
1    1.0
dtype: float64

In [308]:
data.loc[:, "one"] = 1

In [309]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [312]:
data.iloc[2] =5

In [313]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [314]:
data.loc[data["four"] > 5] = 3

In [315]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [316]:
data.loc[data.three == 5, "three"] = 6

In [317]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

In [318]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ["a", "c", "d", "e"])

In [322]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])

In [323]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [324]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [325]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [326]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
   .....:                    index=["Ohio", "Texas", "Colorado"])

In [327]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
   .....:                    index=["Utah", "Ohio", "Texas", "Oregon"])

In [328]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [329]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [330]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [331]:
df1 = pd.DataFrame({"A" : [1, 2]})

In [332]:
df2 = pd.DataFrame({"B" : [3, 4]})

In [333]:
df1

   A
0  1
1  2

In [334]:
df2

   B
0  3
1  4

In [335]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [338]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
   .....:                    columns=list("abcd"))

In [339]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
   .....:                    columns=list("abcde"))

In [340]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [341]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [342]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [343]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [344]:
1 /df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [345]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [346]:
df1.reindex(columns=df2.columns, fill_value =0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [347]:
arr = np.arange(12.).reshape((3, 4))

In [348]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [349]:
arr[0]

array([0., 1., 2., 3.])

In [350]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [351]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [352]:
series = frame.iloc[0]

In [353]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [354]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [355]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [356]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [357]:
series2

b    0
e    1
f    2
dtype: int64

In [358]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [359]:
series3 = frame["d"]

In [360]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [361]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [362]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [364]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
   .....:                      columns=list("bde"),
   .....:                      index=["Utah", "Ohio", "Texas", "Oregon"])

In [365]:
frame

               b         d         e
Utah    2.216666 -0.385789 -1.140128
Ohio   -0.289897  0.760148  0.833385
Texas   2.846726  1.055732 -0.809357
Oregon  0.081169  1.449197 -0.992789

In [366]:
np.abs(frame)

               b         d         e
Utah    2.216666  0.385789  1.140128
Ohio    0.289897  0.760148  0.833385
Texas   2.846726  1.055732  0.809357
Oregon  0.081169  1.449197  0.992789

In [367]:
def f1(x): return x.max() - x.min()

In [368]:
frame.apply(f1)

b    3.136623
d    1.834986
e    1.973513
dtype: float64

In [369]:
frame.apply(f1, axis="columns")

Utah      3.356794
Ohio      1.123282
Texas     3.656084
Oregon    2.441986
dtype: float64

In [371]:
def f2(x):
   .....:     return pd.Series([x.min(), x.max()], index=["min", "max"])

In [372]:
frame.apply(f2)

            b         d         e
min -0.289897 -0.385789 -1.140128
max  2.846726  1.449197  0.833385

In [373]:
def my_format(x): return f"{x: .2f}"

In [374]:
frame.applymap(my_format)

/var/folders/cn/2lgryvj10c92k5wktj1wn8tr0000gp/T/ipykernel_24195/1462544007.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah     2.22  -0.39  -1.14
Ohio    -0.29   0.76   0.83
Texas    2.85   1.06  -0.81
Oregon   0.08   1.45  -0.99

In [375]:
frame.map(my_format)

            b      d      e
Utah     2.22  -0.39  -1.14
Ohio    -0.29   0.76   0.83
Texas    2.85   1.06  -0.81
Oregon   0.08   1.45  -0.99

In [376]:
frame["e"].map(my_format)

Utah      -1.14
Ohio       0.83
Texas     -0.81
Oregon    -0.99
Name: e, dtype: object

In [377]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [378]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [379]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [380]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])

In [381]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [382]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [383]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [385]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [386]:
obj = pd.Series([4, 7, -3, 2])

In [387]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [388]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [389]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [390]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [391]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [392]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [393]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

In [394]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [395]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [396]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [397]:
obj = pd.Series([7, -5, 7, 4, 2, 0 ,4])

In [398]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [400]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [401]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
   .....:                       "c": [-2, 5, 8, -2.5]})

In [402]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [403]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [404]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [405]:
obj.index.is_unique

False

In [406]:
obj["a"]

a    0
a    1
dtype: int64

In [407]:
obj["c"]

4

In [408]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])

In [409]:
df

          0         1         2
a -0.435075  0.672507 -0.124104
a  0.737562  0.719692 -0.077553
b  0.709433 -0.410954  1.056070
b -0.587085 -0.566070 -0.779973
c  1.523608 -0.333014  0.426611

In [410]:
df.loc["b"]

          0         1         2
b  0.709433 -0.410954  1.056070
b -0.587085 -0.566070 -0.779973

In [411]:
df.loc["c"]

0    1.523608
1   -0.333014
2    0.426611
Name: c, dtype: float64

In [412]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
   .....:                    [np.nan, np.nan], [0.75, -1.3]],
   .....:                   index=["a", "b", "c", "d"],
   .....:                   columns=["one", "two"])

In [413]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [414]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [415]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [416]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [417]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [418]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [419]:
df.idxmax()

one    b
two    d
dtype: object

In [420]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [421]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [422]:
price = pd.read_pickle("examples/yahoo_price.pkl")

FileNotFoundError: [Errno 2] No such file or directory: 'examples/yahoo_price.pkl'

In [423]:
conda install pandas-datareader

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done


==> WARNING: A newer version of conda exists. <==
    current version: 24.1.2
    latest version: 24.3.0

Please update conda by running

    $ conda update -n base -c conda-forge conda



## Package Plan ##

  environment location: /Users/deepa/Library/jupyterlab-desktop/jlab_server

  added / updated specs:
    - pandas-datareader


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ca-certificates-2024.3.11  |       hca03da5_0         128 KB
    certifi-2024.2.2           |  py312hca03da5_0         161 KB
    conda-24.3.0               |  py312hca03da5_0         1.2 MB
    libxslt-1.1.39             |       h223e5b9_0         220 KB  conda-forge
    lxml-5.1.0                 |  py312h9bf3b9e_0         1.2 MB  conda-forge
    pandas-datareader-0.10.0   |     pyhd3eb1b0_0          71 KB
    ------------------------------------------------------------
                                           Total:         2.9 MB

The following NEW packages will be INSTALLED:

  libxslt            conda-forge/osx-arm64::libxslt-1.1.39-h223e5b9_0
  lxml               conda-forge/osx-arm64::lxml-5.1.0-py312h9bf3b9e_0
  pandas-datareader  pkgs/main/noarch::pandas-datareader-0.10.0-pyhd3eb1b0_0

The following packages will be UPDATED:

  ca-certificates    conda-forge::ca-certificates-2024.2.2~ --> pkgs/main::ca-certificates-2024.3.11-hca03da5_0
  conda              conda-forge::conda-24.1.2-py312h81bd7~ --> pkgs/main::conda-24.3.0-py312hca03da5_0

The following packages will be SUPERSEDED by a higher-priority channel:

  certifi            conda-forge/noarch::certifi-2024.2.2-~ --> pkgs/main/osx-arm64::certifi-2024.2.2-py312hca03da5_0



Downloading and Extracting Packages:
conda-24.3.0         | 1.2 MB    |                                       |   0%
lxml-5.1.0           | 1.2 MB    |                                       |   0%

libxslt-1.1.39       | 220 KB    |                                       |   0%


certifi-2024.2.2     | 161 KB    |                                       |   0%



ca-certificates-2024 | 128 KB    |                                       |   0%




pandas-datareader-0. | 71 KB     |                                       |   0%



conda-24.3.0         | 1.2 MB    | 4                                     |   1%


certifi-2024.2.2     | 161 KB    | ###6                                  |  10%
lxml-5.1.0           | 1.2 MB    | 4                                     |   1%

libxslt-1.1.39       | 220 KB    | ##6                                   |   7%



conda-24.3.0         | 1.2 MB    | ##9                                   |   8%
lxml-5.1.0           | 1.2 MB    | ########9                             |  24%

libxslt-1.1.39       | 220 KB    | ##################################### | 100%


certifi-2024.2.2     | 161 KB    | #########################6            |  69%


certifi-2024.2.2     | 161 KB    | ##################################### | 100%




pandas-datareader-0. | 71 KB     | ########2                             |  22%




conda-24.3.0         | 1.2 MB    | #############                         |  35%
conda-24.3.0         | 1.2 MB    | ##################4                   |  50%
lxml-5.1.0           | 1.2 MB    | ###################################6  |  96%
















Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [424]:
import pandas_datareader.data as web

In [425]:
import datetime as dt

In [426]:
pip install "yfinance[optional]"

Collecting yfinance[optional]
  Downloading yfinance-0.2.37-py2.py3-none-any.whl.metadata (11 kB)
WARNING: yfinance 0.2.37 does not provide the extra 'optional'
Requirement already satisfied: pandas>=1.3.0 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (2.2.1)
Requirement already satisfied: numpy>=1.16.5 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (1.26.4)
Requirement already satisfied: requests>=2.31 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (2.31.0)
Collecting multitasking>=0.0.7 (from yfinance[optional])
  Downloading multitasking-0.0.11-py3-none-any.whl.metadata (5.5 kB)
Requirement already satisfied: lxml>=4.9.1 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (5.1.0)
Collecting appdirs>=1.4.4 (from yfinance[optional])
  Downloading appdirs-1.4.4-py2.py3-none-any.whl.metadata (9.0 kB)
Requirement already satisfied: pytz>=2022.5 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (2024.1)
Collecting frozendict>=2.3.4 (from yfinance[optional])
  Downloading frozendict-2.4.1.tar.gz (315 kB)
      315.2/315.2 kB 3.4 MB/s eta 0:00:00a 0:00:01
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Installing backend dependencies ... done
  Preparing metadata (pyproject.toml) ... done
Collecting peewee>=3.16.2 (from yfinance[optional])
  Downloading peewee-3.17.1.tar.gz (3.0 MB)
      3.0/3.0 MB 3.9 MB/s eta 0:00:0000:0100:01
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Preparing metadata (pyproject.toml) ... done
Requirement already satisfied: beautifulsoup4>=4.11.1 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from yfinance[optional]) (4.12.3)
Collecting html5lib>=1.1 (from yfinance[optional])
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: soupsieve>1.2 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from beautifulsoup4>=4.11.1->yfinance[optional]) (2.5)
Requirement already satisfied: six>=1.9 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from html5lib>=1.1->yfinance[optional]) (1.16.0)
Requirement already satisfied: webencodings in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from html5lib>=1.1->yfinance[optional]) (0.5.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from pandas>=1.3.0->yfinance[optional]) (2.9.0)
Requirement already satisfied: tzdata>=2022.7 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from pandas>=1.3.0->yfinance[optional]) (2024.1)
Requirement already satisfied: charset-normalizer<4,>=2 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests>=2.31->yfinance[optional]) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests>=2.31->yfinance[optional]) (3.6)
Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests>=2.31->yfinance[optional]) (2.2.1)
Requirement already satisfied: certifi>=2017.4.17 in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from requests>=2.31->yfinance[optional]) (2024.2.2)
Downloading appdirs-1.4.4-py2.py3-none-any.whl (9.6 kB)
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
    112.2/112.2 kB 2.7 MB/s eta 0:00:00 0:00:01
Downloading multitasking-0.0.11-py3-none-any.whl (8.5 kB)
Downloading yfinance-0.2.37-py2.py3-none-any.whl (72 kB)
    73.0/73.0 kB 4.3 MB/s eta 0:00:00
Building wheels for collected packages: frozendict, peewee
  Building wheel for frozendict (pyproject.toml) ... done
  Created wheel for frozendict: filename=frozendict-2.4.1-cp312-cp312-macosx_11_0_arm64.whl size=15503 sha256=9ebe22c1728505d1bd2af03d4b521a5f03229dacc9fc9a49147b434e4a0ee595
  Stored in directory: /Users/deepa/Library/Caches/pip/wheels/a1/2a/ed/313e8c375a307e932fb57a79e12194d3e0fa64748459a76094
  Building wheel for peewee (pyproject.toml) ... done
  Created wheel for peewee: filename=peewee-3.17.1-py3-none-any.whl size=136905 sha256=a61c99e67797bf20771374193f4b7899513322a62a2ce1fa02dcc7fec493df60
  Stored in directory: /Users/deepa/Library/Caches/pip/wheels/fe/58/f4/132ded03aa364dd5d2bbc2d02e1c2074a9b5012776d15fc2dc
Successfully built frozendict peewee
Installing collected packages: peewee, multitasking, appdirs, html5lib, frozendict, yfinance
Successfully installed appdirs-1.4.4 frozendict-2.4.1 html5lib-1.1 multitasking-0.0.11 peewee-3.17.1 yfinance-0.2.37
Note: you may need to restart the kernel to use updated packages.

In [427]:
import yfinance as yf

In [428]:
tickers = yf.Tickers('msft ibm aapl goog')

In [429]:
tickers.tickers['MSFT'].info

{'address1': 'One Microsoft Way',
 'city': 'Redmond',
 'state': 'WA',
 'zip': '98052-6399',
 'country': 'United States',
 'phone': '425 882 8080',
 'website': 'https://www.microsoft.com',
 'industry': 'Software - Infrastructure',
 'industryKey': 'software-infrastructure',
 'industryDisp': 'Software - Infrastructure',
 'sector': 'Technology',
 'sectorKey': 'technology',
 'sectorDisp': 'Technology',
 'longBusinessSummary': 'Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.',
 'fullTimeEmployees': 221000,
 'companyOfficers': [{'maxAge': 1,
   'name': 'Mr. Satya  Nadella',
   'age': 56,
   'title': 'Chairman & CEO',
   'yearBorn': 1967,
   'fiscalYear': 2023,
   'totalPay': 9276400,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Bradford L. Smith LCA',
   'age': 64,
   'title': 'President & Vice Chairman',
   'yearBorn': 1959,
   'fiscalYear': 2023,
   'totalPay': 3591277,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Ms. Amy E. Hood',
   'age': 51,
   'title': 'Executive VP & CFO',
   'yearBorn': 1972,
   'fiscalYear': 2023,
   'totalPay': 3452196,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Judson B. Althoff',
   'age': 49,
   'title': 'Executive VP & Chief Commercial Officer',
   'yearBorn': 1974,
   'fiscalYear': 2023,
   'totalPay': 3355797,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Christopher David Young',
   'age': 51,
   'title': 'Executive Vice President of Business Development, Strategy & Ventures',
   'yearBorn': 1972,
   'fiscalYear': 2023,
   'totalPay': 2460507,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Ms. Alice L. Jolla',
   'age': 56,
   'title': 'Corporate VP & Chief Accounting Officer',
   'yearBorn': 1967,
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. James Kevin Scott',
   'age': 51,
   'title': 'Executive VP of AI & CTO',
   'yearBorn': 1972,
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Brett  Iversen',
   'title': 'Vice President of Investor Relations',
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Hossein  Nowbar',
   'title': 'Chief Legal Officer',
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0},
  {'maxAge': 1,
   'name': 'Mr. Frank X. Shaw',
   'title': 'Chief Communications Officer',
   'fiscalYear': 2023,
   'exercisedValue': 0,
   'unexercisedValue': 0}],
 'auditRisk': 2,
 'boardRisk': 5,
 'compensationRisk': 2,
 'shareHolderRightsRisk': 2,
 'overallRisk': 1,
 'governanceEpochDate': 1711929600,
 'compensationAsOfEpochDate': 1703980800,
 'irWebsite': 'http://www.microsoft.com/investor/default.aspx',
 'maxAge': 86400,
 'priceHint': 2,
 'previousClose': 424.57,
 'open': 420.158,
 'dayLow': 417.842,
 'dayHigh': 422.38,
 'regularMarketPreviousClose': 424.57,
 'regularMarketOpen': 420.158,
 'regularMarketDayLow': 417.842,
 'regularMarketDayHigh': 422.38,
 'dividendRate': 3.0,
 'dividendYield': 0.0070999996,
 'exDividendDate': 1715731200,
 'payoutRatio': 0.2523,
 'fiveYearAvgDividendYield': 0.95,
 'beta': 0.89,
 'trailingPE': 38.036102,
 'forwardPE': 31.521317,
 'volume': 17722802,
 'regularMarketVolume': 17722802,
 'averageVolume': 22740970,
 'averageVolume10days': 18147009,
 'averageDailyVolume10Day': 18147009,
 'bid': 386.34,
 'ask': 453.57,
 'bidSize': 200,
 'askSize': 200,
 'marketCap': 3131484667904,
 'fiftyTwoWeekLow': 275.37,
 'fiftyTwoWeekHigh': 430.82,
 'priceToSalesTrailing12Months': 13.7597475,
 'fiftyDayAverage': 411.823,
 'twoHundredDayAverage': 363.57272,
 'trailingAnnualDividendRate': 2.86,
 'trailingAnnualDividendYield': 0.006736227,
 'currency': 'USD',
 'enterpriseValue': 3161859031040,
 'profitMargins': 0.36269,
 'floatShares': 7418919053,
 'sharesOutstanding': 7430439936,
 'sharesShort': 54210656,
 'sharesShortPriorMonth': 42451775,
 'sharesShortPreviousMonthDate': 1707955200,
 'dateShortInterest': 1710460800,
 'sharesPercentSharesOut': 0.0073,
 'heldPercentInsiders': 0.00054000004,
 'heldPercentInstitutions': 0.73847,
 'shortRatio': 2.46,
 'shortPercentOfFloat': 0.0073,
 'impliedSharesOutstanding': 7430439936,
 'bookValue': 32.06,
 'priceToBook': 13.145352,
 'lastFiscalYearEnd': 1688083200,
 'nextFiscalYearEnd': 1719705600,
 'mostRecentQuarter': 1703980800,
 'earningsQuarterlyGrowth': 0.332,
 'netIncomeToCommon': 82541002752,
 'trailingEps': 11.08,
 'forwardEps': 13.37,
 'pegRatio': 2.24,
 'lastSplitFactor': '2:1',
 'lastSplitDate': 1045526400,
 'enterpriseToRevenue': 13.893,
 'enterpriseToEbitda': 26.699,
 '52WeekChange': 0.4783411,
 'SandP52WeekChange': 0.27878118,
 'lastDividendValue': 0.75,
 'lastDividendDate': 1707868800,
 'exchange': 'NMS',
 'quoteType': 'EQUITY',
 'symbol': 'MSFT',
 'underlyingSymbol': 'MSFT',
 'shortName': 'Microsoft Corporation',
 'longName': 'Microsoft Corporation',
 'firstTradeDateEpochUtc': 511108200,
 'timeZoneFullName': 'America/New_York',
 'timeZoneShortName': 'EDT',
 'uuid': 'b004b3ec-de24-385e-b2c1-923f10d3fb62',
 'messageBoardId': 'finmb_21835',
 'gmtOffSetMilliseconds': -14400000,
 'currentPrice': 421.44,
 'targetHighPrice': 550.0,
 'targetLowPrice': 298.1,
 'targetMeanPrice': 460.92,
 'targetMedianPrice': 462.0,
 'recommendationMean': 1.7,
 'recommendationKey': 'buy',
 'numberOfAnalystOpinions': 48,
 'totalCash': 80981999616,
 'totalCashPerShare': 10.899,
 'ebitda': 118427000832,
 'totalDebt': 111358001152,
 'quickRatio': 1.096,
 'currentRatio': 1.218,
 'totalRevenue': 227583000576,
 'debtToEquity': 46.736,
 'revenuePerShare': 30.612,
 'returnOnAssets': 0.1519,
 'returnOnEquity': 0.39174,
 'freeCashflow': 58680999936,
 'operatingCashflow': 102646996992,
 'earningsGrowth': 0.332,
 'revenueGrowth': 0.176,
 'grossMargins': 0.69815004,
 'ebitdaMargins': 0.52037,
 'operatingMargins': 0.43585998,
 'financialCurrency': 'USD',
 'trailingPegRatio': 2.1532}

In [430]:
price = pd.read_pickle("examples/yahoo_price.pkl")

FileNotFoundError: [Errno 2] No such file or directory: 'examples/yahoo_price.pkl'

In [431]:
tickers.tickers['AAPL'].history(period="1mo")

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
2024-03-04 00:00:00-05:00,176.149994,176.899994,173.789993,175.100006,81510100,0.0,0.0
2024-03-05 00:00:00-05:00,170.759995,172.039993,169.619995,170.119995,95132400,0.0,0.0
2024-03-06 00:00:00-05:00,171.059998,171.240005,168.679993,169.119995,68587700,0.0,0.0
2024-03-07 00:00:00-05:00,169.149994,170.729996,168.490005,169.000000,71765100,0.0,0.0
2024-03-08 00:00:00-05:00,169.000000,173.699997,168.940002,170.729996,76114600,0.0,0.0
2024-03-11 00:00:00-04:00,172.940002,174.380005,172.050003,172.750000,60139500,0.0,0.0
2024-03-12 00:00:00-04:00,173.149994,174.029999,171.009995,173.229996,59825400,0.0,0.0
2024-03-13 00:00:00-04:00,172.770004,173.190002,170.759995,171.130005,52488700,0.0,0.0
2024-03-14 00:00:00-04:00,172.910004,174.309998,172.050003,173.000000,72913500,0.0,0.0
2024-03-15 00:00:00-04:00,171.169998,172.619995,170.289993,172.619995,121664700,0.0,0.0
2024-03-18 00:00:00-04:00,175.570007,177.710007,173.520004,173.720001,75604200,0.0,0.0
2024-03-19 00:00:00-04:00,174.339996,176.610001,173.029999,176.080002,55215200,0.0,0.0
2024-03-20 00:00:00-04:00,175.720001,178.669998,175.089996,178.669998,53423100,0.0,0.0
2024-03-21 00:00:00-04:00,177.050003,177.490005,170.839996,171.369995,106181300,0.0,0.0
2024-03-22 00:00:00-04:00,171.759995,173.050003,170.059998,172.279999,71106600,0.0,0.0
2024-03-25 00:00:00-04:00,170.570007,171.940002,169.449997,170.850006,54288300,0.0,0.0
2024-03-26 00:00:00-04:00,170.000000,171.419998,169.580002,169.710007,57388400,0.0,0.0
2024-03-27 00:00:00-04:00,170.410004,173.600006,170.110001,173.309998,60273300,0.0,0.0
2024-03-28 00:00:00-04:00,171.750000,172.229996,170.509995,171.479996,65672700,0.0,0.0
2024-04-01 00:00:00-04:00,171.190002,171.250000,169.479996,170.029999,46240500,0.0,0.0
2024-04-02 00:00:00-04:00,169.080002,169.339996,168.229996,168.839996,49258300,0.0,0.0

In [432]:
tickers.tickers['GOOG'].actions

                           Dividends  Stock Splits
Date
2014-03-27 00:00:00-04:00        0.0      2.002000
2015-04-27 00:00:00-04:00        0.0      1.002746
2022-07-18 00:00:00-04:00        0.0     20.000000

In [433]:
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

TypeError: string indices must be integers, not 'str'

In [434]:
import pandas_datareader.data as web

In [435]:
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

TypeError: string indices must be integers, not 'str'

In [436]:
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
for ticker, data in all_data.items()})

TypeError: string indices must be integers, not 'str'